#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/aredn-virtual-node/aredn-virtual-node/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/aredn-virtual-node/aredn-virtual-node

To view this run in a browser, visit:
https://app.terraform.io/app/Personal-McSwain/aredn-cloud-node/runs/run-6w6Xw7RsoyK7c9FD

Waiting for the plan to start...

Terraform v1.5.4
on linux_amd64
Initializing plugins and modules...
tls_private_key.key: Refreshing state... [id=27eb3343e1e33cf36b2c32b742247d600f2e3fe9]
data.cloudflare_zone.site-zone: Refreshing...
aws_key_pair.key: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL]
data.aws_ami.ubuntu-jammy: Refreshing...
aws_ebs_volume.ebs: Refreshing state... [id=vol-0d371ff3abebcc7f8]
aws_cloudwatch_log_group.log-group: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL]
data.aws_iam_policy_document.ec2-cloudwatch-logs: Refreshing...
aws_security_group.allow-vpn: Refreshing state... [id=sg-015a05d9f4e18232a]
data.aws_iam_policy_document.ec2-cloudwatch-logs: Refresh complete after 0s [id=1903849331]
aws_iam_role.ec2-cloudwatch-logs: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs]
aws_iam_policy.ec2-cloudwatch-logs: Refreshing state... [id=arn:aws:iam::803205869942:policy/KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs]
aws_iam_instance_profile.ec2-cloudwatch-logs: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs]
aws_iam_role_policy_attachment.ec2-cloudwatch-logs: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs-20230106063902346900000001]
data.aws_ami.ubuntu-jammy: Refresh complete after 0s [id=ami-05d251e0fc338590c]
data.cloudflare_zone.site-zone: Refresh complete after 0s [id=1896d1131a72f9255386a78c50024864]
aws_instance.node: Refreshing state... [id=i-0ba212595051072e3]
aws_volume_attachment.ebs_att: Refreshing state... [id=vai-1915124156]
aws_eip.ip: Refreshing state... [id=eipalloc-0fd8f90c301c448a7]
cloudflare_record.record: Refreshing state... [id=3dbc3636104e97d4d629bffa81773460]
aws_iam_role.ec2-cloudwatch-logs: Drift detected (update)
aws_instance.node: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.ip will be updated in-place
  ~ resource "aws_eip" "ip" {
        id                   = "eipalloc-0fd8f90c301c448a7"
      ~ instance             = "i-0ba212595051072e3" -> (known after apply)
        tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # aws_instance.node must be replaced
-/+ resource "aws_instance" "node" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:803205869942:instance/i-0ba212595051072e3" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0ba212595051072e3" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-08122781e8a347db5" -> (known after apply)
      ~ private_dns                          = "ip-172-31-0-8.us-east-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.31.0.8" -> (known after apply)
      ~ public_dns                           = "ec2-18-189-227-206.us-east-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "18.189.227.206" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "KI5VMF-CLOUD-TUNNEL-vpn",
        ] -> (known after apply)
      ~ subnet_id                            = "subnet-c6795aae" -> (known after apply)
        tags                                 = {
            "Name" = "KI5VMF-CLOUD-TUNNEL"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
        # (10 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdf" -> null
          - encrypted             = true -> null
          - iops                  = 100 -> null
          - kms_key_id            = "arn:aws:kms:us-east-2:803205869942:key/f09f6063-61b8-4ed9-9af7-1e12deceda0f" -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0d371ff3abebcc7f8" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0fde948e9b3143e7a" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # aws_volume_attachment.ebs_att must be replaced
-/+ resource "aws_volume_attachment" "ebs_att" {
      ~ id                             = "vai-1915124156" -> (known after apply)
      ~ instance_id                    = "i-0ba212595051072e3" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

```
</details>
*Pushed by: @USA-RedDragon, Action: `pull_request`*